benchmark/report/rps/full/20260804_190000/raw/009_auth_me_c50_r1.txt
Running 20s test @ http://127.0.0.1:32774/api/auth/me
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   129.05ms   18.55ms 174.51ms   62.58%
    Req/Sec    46.41     11.12   120.00     63.30%
  Latency Distribution
     50%  129.54ms
     75%  144.44ms
     90%  152.16ms
     99%  164.18ms
  7439 requests in 20.09s, 5.09MB read
Requests/sec:    370.23
Transfer/sec:    259.59KB
HPS_WRK_REQUESTS 7439
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 7439
HPS_STATUS_2XX 7439
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=7439